---
kind: method
id: M:Autodesk.Revit.DB.Part.CanOffsetFace(Autodesk.Revit.DB.Face)
source: html/ca466002-8d4e-bd3c-e591-5ca37c983bb1.htm
---
# Autodesk.Revit.DB.Part.CanOffsetFace Method

Checks if it is possible to offset the given face.

## Syntax (C#)
```csharp
public bool CanOffsetFace(
	Face face
)
```

## Parameters
- **face** (`Autodesk.Revit.DB.Face`) - face to be checked.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null